{
    "error.VIOLATION::RP_AGE_TO_YOUNG": "You must be at least 18 years old to order with Ratepay.",
    "error.VIOLATION::RP_INVALID_AGE": "Please provide a valid date for your birthday.",
    "error.VIOLATION::RP_MISSING_IBAN": "Please provide a valid IBAN.",
    "error.VIOLATION::RP_INVALID_COUNTRY_CODE_ERROR": "The country of the IBAN is not valid.",
    "error.VIOLATION::RP_CHECKSUM_FAILED_ERROR": "The check digits of the IBAN are invalid.",
    "error.VIOLATION::RP_INVALID_FORMAT_ERROR": "Please provide a valid IBAN.",
    "error.VIOLATION::RP_NOT_SUPPORTED_COUNTRY_CODE_ERROR": "The country of the IBAN is not valid.",
    "error.VIOLATION::RP_MISSING_SEPA_CONFIRM": "Please confirm the SEPA mandate.",
    "error.VIOLATION::RP_METHOD_NOT_AVAILABLE": "Unfortunately, it is not possible to use the selected payment method. This decision is based on an automated data processing procedure. For details click <a href=\"https://www.ratepay.com/en/ratepay-terms-of-payment/\" target=\"_blank\">additional terms and conditions and privacy policies for our payment provider</a>.",
    "error.VIOLATION::METHOD_NOT_AVAILABLE": "Unfortunately, it is not possible to use the selected payment method.",
    "error.VIOLATION::RP_MISSING_BANK_ACCOUNT_HOLDER": "Please provide a bank account owner.",
    "error.VIOLATION::RP_INVALID_BANK_ACCOUNT_HOLDER": "Please provide a valid bank account owner.",
    "ratepay": {
        "storefront": {
            "admin-order": {
                "notice": "You are going create a new order as admin. So the Ratepay profiles, which are available for admin orders will be used. The other profiles will be not available.",
                "close-session": "Terminate session",
                "session-destroyed": "The admin session has been terminated. Now you can create normal orders again."
            },
            "checkout": {
                "finish": {
                    "info": {
                        "transaction-id": "Transaction number:",
                        "descriptor": "Descriptor:"
                    }
                },
                "label": {
                    "birthday": "Date of birth"
                },
                "fields": {
                    "accountHolder": "Account holder",
                    "iban": "IBAN",
                    "bic": "BIC"
                },
                "hints": {
                    "birthdayHint": "You must be at least 18 years old to pay using %method%.",
                    "legalText": "With clicking on \"Submit order\" you agree to the <a href=\"//www.ratepay.com/legal-payment-terms\" title=\"Legal Payment Terms\" target=\"_blank\">terms of payment of our payment partner</a> as well as to the performance of a <a href=\"//www.ratepay.com/legal-payment-dataprivacy\" title=\"Legal Payment Dataprivacy\" target=\"_blank\">risk check by our payment partner</a>.",
                    "sepaLegalText": "Ratepay GmbH, Franklinstraße 28-29, D-10587 Berlin, Germany<br>Creditor ID: DE39RPY00000568463<br>Mandate Reference: WILL BE COMMUNICATED SEPARATELY",
                    "sepaAuthorize": "I hereby authorise Ratepay GmbH to collect payments from my account by direct debit. At the same time, I authorise my bank to debit my account in accordance with the instructions from Ratepay GmbH.",
                    "sepaAuthorizeNote": "Note: As part of my rights, I am entitled to a refund from my bank under the terms and conditions of my agreement with my bank. A refund must be claimed within 8 weeks starting from the date on which my account was debited. My rights are explained in a statement that I can obtain from my bank."
                },
                "installment": {
                    "intro": "In the following you can decide how you would like to organise the payment by instalment. Simply specify the number of instalments and therefore <b> the runtime</b> of the instalment or simply specify the preferred <b>number of monthly instalments</b>."
                }
            }
        }
    }
}
